# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSet..::..Erase Method
DocumentSet Class See Also
---
Removes a specified object from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	Document item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As Document _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	Document^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..DocumentThe item to be erased.
# ### Return Value
The number of items that were erased from the set.
# See Also
DocumentSet Class
Autodesk.Revit.DB Namespace